app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(params.require(:school_class))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2019-01-27 15:42:32.216605"], ["updated_at", "2019-01-27 15:42:32.216605"]]